---
kind: type
id: T:Autodesk.Revit.DB.Structure.FabricWireItem
source: html/ec68f4e9-ba5a-6036-7d5a-2718689ef95f.htm
---
# Autodesk.Revit.DB.Structure.FabricWireItem

Provides implementation for FabricWires stored in a Custom Fabric Sheet

## Syntax (C#)
```csharp
public class FabricWireItem : IDisposable
```